{
  "reading": "Introduction to English Language Teaching in Timor-Leste\\n\\nEnglish language education has become an increasingly important focus in Timor-Leste's education system in recent years. As a young nation seeking to engage more fully with the global community, Timor-Leste has recognized the value of English proficiency for its citizens. This paper will examine the current state of English language teaching in Timor-Leste, including government policies, teaching approaches, and key challenges.\\n\\nTimor-Leste's Ministry of Education has implemented policies to expand and improve English language instruction throughout the country's schools. English is now a compulsory subject starting from the upper primary grades through secondary school. The government has set ambitious goals to increase the number of qualified English teachers and to raise overall English proficiency levels among students. Current policies aim to provide students with at least 3-4 hours of English instruction per week at the secondary level.\\n\\nA key focus of English language teaching reform in Timor-Leste has been a shift towards more [BLANK_1], learner-centered approaches. Traditionally, English classes in Timor-Leste relied heavily on grammar translation methods and rote memorization. However, teacher training programs are now emphasizing [BLANK_2] principles. CLT prioritizes meaningful interaction in the [BLANK_3], use of [BLANK_4], and integration of all language skills (reading, writing, speaking, listening).\\n\\nSome key features of the communicative approach being promoted in Timor-Leste's English classrooms include:\\n\\n- Increased opportunities for student speaking practice through pair and group work\\n- Use of games, role-plays, and information gap activities to encourage authentic communication\\n- Integration of Timorese culture and real-life situations into lesson content\\n- Reduced emphasis on explicit grammar instruction and increased focus on fluency\\n- More learner autonomy and student-centered activities\\n\\nWhile communicative methods are gaining traction, implementation remains a challenge in many schools. Large class sizes, limited resources, and teachers' own English proficiency levels can make it difficult to fully embrace CLT principles. Many teachers still rely heavily on textbooks and teacher-centered methods.\\n\\nThe use of authentic materials is another important aspect of English language teaching reform in Timor-Leste. There is a push to incorporate more real-world English texts and media into lessons, rather than relying solely on textbooks designed for language learners. Examples include English-language newspapers, songs, advertisements, and online videos. The goal is to expose students to natural language use and prepare them to engage with English in real-world contexts.\\n\\nAssessment practices are also evolving as part of English teaching reforms. There is a move away from grammar-focused written tests towards more holistic evaluation of students' communicative competence. This includes increased use of oral assessments, project-based learning, and portfolio assessment. However, high-stakes exams still tend to emphasize grammar and reading comprehension.\\n\\nTeacher training and professional development are critical priorities for improving English instruction in Timor-Leste. Many English teachers, especially in rural areas, lack strong English skills themselves. The government has partnered with international organizations to provide in-service training programs focused on language proficiency and communicative teaching methods. There are also efforts to improve pre-service teacher education programs at universities.\\n\\nDespite progress, significant challenges remain in English language education in Timor-Leste. Limited access to English outside the classroom makes it difficult for students to practice and maintain their skills. A shortage of qualified teachers, especially in rural areas, impacts the quality and consistency of instruction. Limited teaching resources and large class sizes also pose obstacles to implementing more interactive, student-centered approaches.\\n\\nIn conclusion, English language teaching in Timor-Leste is in a period of transition and development. Government policies have elevated the importance of English instruction, and there is a clear push towards more communicative, [BLANK_5] approaches. However, fully implementing these reforms across the education system will be a long-term process. Continued investment in teacher training, curriculum development, and educational resources will be essential to achieving Timor-Leste's goals for English language education. As the country continues to engage more actively in regional and global affairs, effective English instruction will play a vital role in expanding opportunities for Timorese citizens.",
  "vocabulary": {
    "[BLANK_1]": "communicative",
    "[BLANK_2]": "communicative language teaching",
    "[BLANK_3]": "target language",
    "[BLANK_4]": "authentic materials",
    "[BLANK_5]": "learner-centered",
    "[BLANK_6]": "language policy",
    "[BLANK_7]": "L1",
    "[BLANK_8]": "scaffolding",
    "[BLANK_9]": "task-based learning",
    "[BLANK_10]": "fluency"
  }
}