{
    "class": "Ranger",
    "element": "Water",
    "archetype": "Hunter",
    "attributes": {
        "Strength": 11,
        "Dexterity": 13,
        "Constitution": 16,
        "Intelligence": 14,
        "Wisdom": 11,
        "Charisma": 11
    },
    "main_weapon": "Shortsword",
    "equipment": [
        "Shortsword",
        "Backpack",
        "Torches (10)",
        "Healing Potion"
    ],
    "spells": [],
    "background_story": "Adasd's story begins in the mist-shrouded coastal village of Wavecrest, a small settlement perched precariously on the edge of the Whispering Marshes. From a young age, Adasd was drawn to the eerie beauty of the swamps and the secrets they held. His father, a skilled fisherman, taught him the ways of the water, while his mother, a village healer, instilled in him a deep respect for nature's balance.\n\nAs Adasd grew, he became known for his keen eye and steady hand with a shortsword, skills honed through countless hours of practice and necessity. The marshes were home to many dangers, and the villagers relied on those who could protect them from the lurking threats.\n\nOne fateful night, when Adasd was barely sixteen, a horrifying creature emerged from the depths of the swamp. It was a nightmarish fusion of man and fish, with razor-sharp claws and glowing eyes that seemed to pierce the soul. The monster tore through the village, leaving destruction in its wake. Adasd's parents, along with many others, fell victim to the beast's rampage.\n\nDriven by grief and a burning desire for vengeance, Adasd dedicated himself to becoming a protector of the innocent and a hunter of the dark creatures that plagued the land. He spent years training with the few rangers who dared to patrol the edges of the Whispering Marshes, learning to track and combat the supernatural threats that dwelled within.\n\nAdasd's natural affinity for water proved to be a powerful asset. He learned to move silently through the swamps, using the mist and murky waters to his advantage. His connection to the element allowed him to sense disturbances in the natural flow of things, often alerting him to the presence of unnatural beings.\n\nAs his skills grew, so did his reputation. Adasd became known as the \"Mist Walker,\" a guardian who could navigate the treacherous swamps with ease and face down the most terrifying of creatures. His shortsword, a gift from his father and his most prized possession, became infamous for its ability to strike true even in the thickest fog.\n\nDespite his growing renown,",
    "movement_speed": 32,
    "name": "adasd",
    "gender": "male",
    "hit_points": 13,
    "max_hit_points": 13,
    "level": 1,
    "purchased_items": [],
    "remaining_money": 43
}