{
    "class": "Monk",
    "element": "Water",
    "archetype": "Way of Shadow",
    "attributes": {
        "Strength": 14,
        "Dexterity": 17,
        "Constitution": 12,
        "Intelligence": 9,
        "Wisdom": 13,
        "Charisma": 13
    },
    "main_weapon": "Quarterstaff",
    "equipment": [
        "Quarterstaff",
        "Backpack",
        "Rope (50 feet)",
        "Bedroll"
    ],
    "spells": [],
    "background_story": "Del's story begins in a small fishing village nestled along the misty shores of the Whispering Coast. Born during a violent storm that nearly destroyed the village, Del was believed to be blessed by the water spirits. As he grew, he displayed an uncanny affinity for water and an unusual ability to blend into the shadows.\n\nAt a young age, Del's village was attacked by shapeshifting demons known as the Mist Walkers. These ethereal creatures emerged from the fog, slaughtering villagers and dragging others into the murky depths. During the chaos, Del instinctively used the shadows to hide, narrowly escaping the massacre. He was the sole survivor.\n\nOrphaned and alone, Del wandered the treacherous swamps surrounding his destroyed home. It was here that he encountered Master Zhen, a reclusive monk of the Order of the Midnight Tide. Recognizing the boy's potential, Zhen took Del under his wing, teaching him the ways of the shadow monk and honing his natural connection to water.\n\nFor years, Del trained in the hidden monastery of the Midnight Tide, learning to harness the power of shadows and water. He mastered the art of stealth, moving silently through the misty forests and blending seamlessly with the darkness. His quarterstaff became an extension of himself, as fluid and unpredictable as the water he commanded.\n\nAs Del's training progressed, he discovered that the Order of the Midnight Tide had a greater purpose. They were guardians against the dark creatures that plagued the realm, using their mastery over shadow and water to combat the nightmarish beings that threatened the innocent.\n\nOn the eve of his final trial, Del learned a shocking truth. The Mist Walkers who destroyed his village were not mere demons, but corrupted former members of the Order. This revelation shook Del to his core, forcing him to confront the possibility that the very power he wielded could lead to his own downfall.\n\nDetermined to prove himself worthy and to prevent others from suffering the same fate as his village, Del set out on a quest. Armed with his quarterstaff and the skills honed through years of training, he vowed to hunt down the remaining Mist Walkers and uncover the source of their corruption",
    "movement_speed": 34,
    "name": "Del",
    "gender": "male",
    "hit_points": 11,
    "max_hit_points": 11,
    "level": 1,
    "purchased_items": [],
    "remaining_money": 5
}