{
    "class": "Fighter",
    "element": "Water",
    "archetype": "Guardian",
    "attributes": {
        "Strength": 12,
        "Dexterity": 10,
        "Constitution": 12,
        "Intelligence": 10,
        "Wisdom": 12,
        "Charisma": 14
    },
    "main_weapon": "Battleaxe",
    "equipment": [
        "Battleaxe",
        "Waterskin",
        "Torches (10)",
        "Tinderbox"
    ],
    "spells": [],
    "background_story": "Elgin's story begins in the coastal village of Mistwater, a small settlement perched on the edge of the Whispering Marshes. From a young age, Elgin was drawn to the water, finding solace in the rhythmic lapping of waves against the shore and the eerie calm of the misty swamps. His father, a respected guardian of the village, instilled in him a deep sense of duty and protection.\n\nAs Elgin grew, he began to notice strange occurrences in the marshes. Whispers carried on the wind, shadows moving against the current, and eerie lights flickering in the fog. The elders spoke of ancient water spirits and shapeshifting demons that resided in the depths, but most dismissed these as old wives' tales.\n\nOn his sixteenth birthday, Elgin's father gifted him an old battleaxe, a family heirloom said to be blessed by the water spirits. That very night, as Elgin stood watch at the village's edge, he witnessed a terrifying sight. A monstrous creature, half-serpent and half-woman, emerged from the swamp, its eyes gleaming with malevolence. Without hesitation, Elgin raised his axe and engaged the beast in combat.\n\nThe battle was fierce, but Elgin's innate connection to water seemed to guide his movements. As the creature lunged, he dodged with fluid grace, his axe singing through the air. With a final, mighty blow, he cleaved the monster in two, its form dissipating into mist.\n\nWord of Elgin's bravery spread quickly, and he was hailed as a hero. The village elders revealed that they had long known of the dangers lurking in the marshes and had been waiting for a guardian with the strength and spirit to protect them. Elgin embraced this role, training tirelessly to hone his skills as a fighter and protector.\n\nOver the years, Elgin faced numerous threats – from vengeful water wraiths to demonic entities that sought to drag villagers into the murky depths. His reputation grew, and soon, people from neighboring settlements sought his aid in battling the dark forces that plagued the land.\n\nDespite his growing fame, Elgin remained humble, always carrying his",
    "movement_speed": 15,
    "name": "Elgin",
    "gender": "male",
    "hit_points": 11,
    "max_hit_points": 11,
    "level": 1,
    "purchased_items": [],
    "remaining_money": 215
}