{
    "class": "Barbarian",
    "element": "Water",
    "archetype": "Totem Warrior",
    "attributes": {
        "Strength": 13,
        "Dexterity": 17,
        "Constitution": 19,
        "Intelligence": 10,
        "Wisdom": 13,
        "Charisma": 13
    },
    "main_weapon": "Maul",
    "equipment": [
        "Maul",
        "Tinderbox",
        "Rations (1 week)",
        "Torches (10)"
    ],
    "spells": [],
    "background_story": "Hon Holhgf's story begins in a remote coastal village nestled between the churning seas and the misty forests of the realm. Born to a clan of fierce warriors who revered the power of water, Hon was raised to respect and harness the strength of the ocean.\n\nFrom a young age, Hon displayed an uncanny connection to water. He could sense approaching storms and calm turbulent waves with a mere touch. The village elders recognized this gift and began training him in the ways of the Totem Warrior, teaching him to channel the spirits of aquatic creatures.\n\nAs Hon grew, so did his strength and agility. He became known for his swift movements and powerful strikes, reminiscent of the crashing waves. His weapon of choice, a massive maul, was forged from the metal of a sunken ship and blessed by the village shaman. Hon named it \"Tidecaller,\" and it became an extension of his will.\n\nHowever, Hon's peaceful existence was shattered when a nightmarish creature emerged from the depths of the ocean. This shapeshifting demon, known as the Kraken's Shadow, began terrorizing coastal settlements, leaving destruction and despair in its wake. Hon's village was one of its victims, and he watched helplessly as many of his clansmen were dragged into the murky depths.\n\nFilled with grief and rage, Hon swore vengeance against the Kraken's Shadow and all dark creatures that threatened the land. He embarked on a journey to hone his skills and gather allies strong enough to face the horrors that plagued the realm.\n\nDuring his travels, Hon encountered a wise hermit who taught him to temper his fury with wisdom. This training allowed Hon to enter a controlled rage state, channeling his emotions into raw power without losing himself to mindless anger. The hermit also gifted Hon with a tinderbox, explaining that even in the darkest of times, one must always be able to create light.\n\nHon's quest led him through treacherous swamps and haunted forests, where he faced vengeful spirits and demonic entities. Each battle hardened his resolve and increased his understanding of the supernatural threats facing the world. He learned to rely not only on his strength but also on his instincts and the guidance of water spirits.\n\nNow, Hon Holh",
    "movement_speed": 31,
    "name": "hon holhgf",
    "gender": "male",
    "hit_points": 14,
    "max_hit_points": 14,
    "level": 1,
    "purchased_items": [],
    "remaining_money": 6
}