{
    "class": "Cleric",
    "element": "Water",
    "archetype": "Trickery Domain",
    "attributes": {
        "Strength": 10,
        "Dexterity": 15,
        "Constitution": 11,
        "Intelligence": 8,
        "Wisdom": 14,
        "Charisma": 16
    },
    "main_weapon": "Warhammer",
    "equipment": [
        "Warhammer",
        "Rations (1 week)",
        "Rope (50 feet)",
        "Tinderbox"
    ],
    "spells": [
        {
            "name": "Fireball",
            "description": "A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame."
        },
        {
            "name": "Shield",
            "description": "An invisible barrier of magical force appears and protects you."
        },
        {
            "name": "Detect Magic",
            "description": "For the duration, you sense the presence of magic within 30 feet of you."
        },
        {
            "name": "Magic Missile",
            "description": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range."
        }
    ],
    "background_story": "Steve, the Trickster of Tides\n\nBorn in a small coastal village nestled between misty forests and treacherous swamps, Steve was an enigma from the start. His parents, humble fisherfolk, were baffled by their son's uncanny ability to manipulate water and his penchant for mischief. As a child, Steve would often disappear for hours, only to be found giggling in hidden tide pools or whispering to the swamp mists.\n\nAs he grew older, the village elders began to whisper that Steve might be touched by Zephyra, the capricious goddess of water and deceit. His charisma and wit drew others to him, but his tricks and illusions often left them wary. Despite his less than stellar physical prowess and somewhat dim intellect, Steve's natural affinity for water and his silver tongue kept him out of most trouble.\n\nOn his sixteenth birthday, Steve's life took a dramatic turn. A nightmarish creature, born from the depths of local legends, emerged from the swamps and began terrorizing the village. This shapeshifting demon, known as the Mist Wraith, fed on the fear and confusion of its victims. While the village's warriors proved ineffective against the ethereal beast, it was Steve who managed to trick the creature, using his water manipulation and clever illusions to lure it into a trap.\n\nImpressed by Steve's cunning and connection to water, a wandering cleric of Zephyra took him under her wing. She taught him to channel his innate abilities through the goddess's divine power, honing his skills in both trickery and water manipulation. Steve learned to wield a warhammer, not through brute strength, but with dexterous flourishes and watery illusions that confused and disoriented his opponents.\n\nFor years, Steve traveled with his mentor, learning the ways of the Trickery Domain and facing the dark creatures that plagued the realm. He developed a reputation as a protector of the innocent, using his wits and water-based clerical magic to outsmart and defeat vengeful spirits and demonic entities.\n\nNow, Steve roams the land alone, his mentor having disappeared under mysterious circumstances. He carries with him his trusty warhammer, a week",
    "movement_speed": 31,
    "name": "Steve",
    "gender": "male",
    "hit_points": 10,
    "max_hit_points": 10,
    "level": 1,
    "purchased_items": [],
    "remaining_money": 343
}