{
    "class": "Paladin",
    "element": "Water",
    "archetype": "Oath of the Ancients",
    "attributes": {
        "Strength": 14,
        "Dexterity": 12,
        "Constitution": 13,
        "Intelligence": 11,
        "Wisdom": 18,
        "Charisma": 18
    },
    "main_weapon": "Warhammer",
    "equipment": [
        "Warhammer",
        "Torches (10)",
        "Backpack",
        "Tinderbox"
    ],
    "spells": [],
    "background_story": "Totalari's story begins in the coastal village of Mist Haven, a small settlement nestled between the treacherous Whispering Woods and the vast, unpredictable Tempest Sea. Born to a family of fishermen, Totalari's early years were filled with the rhythmic sounds of crashing waves and the salty tang of sea air. However, his destiny would lead him far from the familiar shores of his homeland.\n\nAs a child, Totalari was known for his unwavering kindness and an uncanny ability to calm both people and animals. This gift caught the attention of Eldara, an aging paladin of the Oath of the Ancients who had retired to Mist Haven. Recognizing the boy's potential, Eldara took Totalari under her wing, teaching him the ways of the ancient oath and the importance of preserving the balance between civilization and nature.\n\nTotalari's training was unconventional, blending the traditional martial disciplines of a paladin with a deep connection to the element of water. Eldara taught him to harness the fluid strength of the tides and the relentless power of the ocean, channeling these forces through his faith and his warhammer.\n\nOn his eighteenth birthday, Totalari's peaceful life was shattered when a horde of shapeshifting demons known as the Mist Walkers emerged from the Whispering Woods. These terrifying creatures, born from the nightmares of the ancient forest, descended upon Mist Haven with savage fury. In the chaos of the attack, Eldara sacrificed herself to save the village, using her last breath to entrust Totalari with her own warhammer and the sacred duty of the Oath of the Ancients.\n\nGrief-stricken but resolute, Totalari took up his mentor's weapon and rallied the villagers. Drawing upon his training and his innate connection to water, he called forth a great tidal wave that swept the demons back into the woods. This act of bravery and power marked him as a true paladin and a defender of the realm.\n\nIn the years that followed, Totalari traveled the land, guided by his oath to preserve the delicate balance between light and darkness. He became known as the Tide Hammer, a",
    "movement_speed": 34,
    "name": "Totalari",
    "gender": "male",
    "hit_points": 11,
    "max_hit_points": 11,
    "level": 1,
    "purchased_items": [],
    "remaining_money": 447
}