{
    "class": "Warlock",
    "element": "Water",
    "archetype": "Great Old One Pact",
    "attributes": {
        "Strength": 17,
        "Dexterity": 15,
        "Constitution": 9,
        "Intelligence": 14,
        "Wisdom": 16,
        "Charisma": 10
    },
    "main_weapon": "Dagger",
    "equipment": [
        "Dagger",
        "Healing Potion",
        "Backpack",
        "Bedroll"
    ],
    "spells": [
        {
            "name": "Shield",
            "description": "An invisible barrier of magical force appears and protects you."
        },
        {
            "name": "Magic Missile",
            "description": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range."
        },
        {
            "name": "Fireball",
            "description": "A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame."
        }
    ],
    "background_story": "Zel's tale begins in the coastal village of Mirewatch, a small settlement perched on the edge of the Whispering Marshes. From a young age, Zel was fascinated by the eerie beauty of the swamplands and the secrets they held. His parents, both skilled fishers, warned him of the dangers that lurked beneath the murky waters, but their cautions only fueled his curiosity.\n\nAs a teenager, Zel's strength and dexterity made him an asset to the village, helping to haul in heavy nets and navigate treacherous waters. However, his true passion lay in unraveling the mysteries of the marsh. He would often venture into the swamps alone, much to the dismay of his parents and the village elders.\n\nOn one fateful expedition, Zel ventured deeper into the marsh than ever before. The mists thickened around him, and the air grew heavy with an otherworldly presence. As he pushed through the fog, he stumbled upon an ancient, half-submerged shrine. The structure was covered in strange, undulating symbols that seemed to writhe and shift before his eyes.\n\nDrawn by an inexplicable compulsion, Zel approached the shrine. As he placed his hand on the slimy stone, a vision overwhelmed him. He saw vast, impossible geometries beneath the waves, tentacles that stretched across eons, and a great, slumbering entity of unfathomable power.\n\nWhen Zel awoke, he found himself back in his village, clutching a curved dagger of unknown origin. The village healer tended to him, but could not explain his weakened constitution or the strange, aquatic whispers that now plagued his dreams.\n\nIn the weeks that followed, Zel discovered he could manipulate water in ways that defied natural law. He realized that he had entered into a pact with an ancient being from the depths – a Great Old One that granted him eldritch powers in exchange for his service.\n\nFeared and misunderstood by his fellow villagers, Zel decided to leave Mirewatch to seek answers about his newfound abilities and the entity he now served. He packed his meager belongings – his mysterious dagger, a healing potion gifted by",
    "movement_speed": 30,
    "name": "Zel",
    "gender": "male",
    "hit_points": 9,
    "max_hit_points": 9,
    "level": 1,
    "purchased_items": [],
    "remaining_money": 69
}