[
  "Arrr, blast ye to the depths, ye scurvy dog! Ye may have won this day, but mark me words - I'll be back to send ye and yer crew to Davy Jones' locker! Ye think ye've bested me? Ha! This be but a temporary setback for the likes o' me. Enjoy yer victory while ye can, ye bilge rat, for I swear on me own black heart that I'll have me revenge. Next time we cross swords, it'll be yer bones decoratin' the sea floor!",
  "Arrr, ye scurvy dog! Ye may have bested me this time, but mark me words - this ain't the last ye'll be seein' of ol' Tok Janggut! Ye've won the day, but the sea be a fickle mistress. Don't be gettin' too comfortable on yer high horse, ye bilge rat. I'll be back with a vengeance, and next time, I'll send ye and yer sorry crew to Davy Jones' locker! Curse yer black heart and may yer rum always be sour!",
  "Arrr, ye scurvy dog! Ye may have bested me this time, but mark me words - this ain't the last ye'll be seein' of me, ye bilge-sucking landlubber! May yer rum always be sour and yer gold turn to lead! I'll be back to send ye to Davy Jones' locker, mark my words! Ye've won the day, but the sea be a fickle mistress, and fortune may not smile on ye so kindly next time we cross swords. Enjoy yer victory while it lasts, ye mangy swab!",
  "Blast me barnacles and shiver me splintered mast! Ye've bested me fair and square, ye scurvy-ridden sea slug. May the kraken drag yer ship to Davy Jones' locker and use yer bones as toothpicks! I'll be keel-hauled and fed to the sharks before I admit defeat gracefully, ye bilge-sucking, pox-faced son of a drunken mermaid! But mark me words, ye pompous powder monkey, I'll be back to dance on yer watery grave when Neptune himself spits ye out! Now, if ye'll excuse me, I need to go lick me wounds and drown me sorrows in a barrel o' grog.",
  "Blimey and barnacles! Ye've bested me fair and square, ye bilge-sucking sea dog. May the kraken feast on me liver if I ain't impressed by yer tactics. Shiver me timbers, I thought I had ye cornered like a lobster in a trap, but ye slipped through me claws like a greased eel. Arrr, I'll be keelhauled and fed to the sharks before I admit it easy, but ye've earned yer victory, ye scurvy-ridden scallywag. Mark me words, though - this ain't the last ye'll see of this old salt. I'll be back to dance the hempen jig with ye again, and next time, I'll send ye to Davy Jones' locker faster than ye can say \"pieces of eight\"!",
  "Shiver me timbers, ye bilge-suckin' barnacle! Ye may have won this day, but mark me words, I'll be back to keelhaul yer sorry hide! By Davy Jones' locker, I ain't never seen such a scurvy trick as ye pulled. Ye fight dirtier than a mermaid's armpit! Arrr, me ship may be scuttled and me crew scattered to the four winds, but ye haven't seen the last of this old sea dog. I'll raise meself a new crew of cutthroats and scalawags that'll make yer blood run colder than a kraken's kiss! Enjoy yer victory while ye can, ye slack-jawed, grog-swillin' landlubber - for when next we meet, I'll send ye to dance the hempen jig!",
  "Shiver me timbers and blow me down! Ye've bested me fair and square, ye scurvy sea dog. I'll be keel-hauled and pickled if I ain't grateful fer yer mercy, ye barnacle-covered bilge rat. By the kraken's tentacles, I thought I'd be dancin' with ol' Davy Jones himself, but ye've shown a heart softer than a mermaid's kiss. May yer hold always be full o' plunder and yer grog never run dry, ye magnanimous swab! I'll sing yer praises in every port from here to the Spanish Main, or may the sea witch curse me guts with eternal seasickness!",
  "Blimey and barnacles! Me ship's at the bottom o' Davy Jones' locker and me crew's scattered like fish bait in a storm. But shiver me timbers, that bilge-suckin' captain's shown a sliver o' mercy to this old sea dog. I'll be kissin' the gunner's daughter if I ever cross his path again! \n\nBy the kraken's slimy tentacles, I'm grateful to still have me sea legs under me, even if they're standin' on enemy planks. Ye can bet yer last doubloon I'll be rememberin' this act o' kindness, rare as a mermaid's tooth in these briny waters. \n\nSink me, but I've learned me lesson. Perhaps it's time to trade me cutlass for a fishin' pole and leave the plunderin' to younger scalawags. But mark me words, the sea's still in me blood, ye flask-swiggin' landlubbers!",
  "Arr, ye bilge-suckin' barnacle! Ye may've bested me on the briny blue, but ye've shown a heart o' gold by sparin' this old sea dog's hide. I'll be flippin' me fins in Davy Jones' locker soon enough without yer help, ye scurvy-fightin' saint! May the mermaids sing ye sweet shanties and the winds always fill yer sails, ye magnificent mackeral! I'll raise a jug o' grog to yer mercy, and may the kraken's tentacles never tickle yer keel!",
  "\"Shiver me timbers and keelhaul me soul! Ye may have bested me this day, ye bilge-sucking sea rats, but mark me words - the kraken's kiss awaits ye all! I'll be dancin' with the devil in Davy Jones' locker, but me spirit'll haunt these waters 'til the seas run dry! May yer compasses spin like a drunken albatross and yer maps turn to fish food! Ye've not seen the last o' this old sea dog, ye scurvy-ridden, barnacle-brained swabs! I'll see ye in the locker, and we'll share a tankard o' brine! Arrr!\""
]