{
    "class": "Ranger",
    "element": "Water",
    "archetype": "Beast Master",
    "attributes": {
        "Strength": 11,
        "Dexterity": 17,
        "Constitution": 9,
        "Intelligence": 10,
        "Wisdom": 17,
        "Charisma": 8
    },
    "main_weapon": "Longbow",
    "equipment": [
        "Longbow",
        "Rations (1 week)",
        "Healing Potion",
        "Bedroll"
    ],
    "spells": [],
    "background_story": "In the mist-shrouded realm of Shadowmere, where ancient horrors stalk the land, there lived a peculiar boy named Asdasd. Born in a small fishing village on the edge of the Whispering Swamp, Asdasd was an outcast from the start. His name, a result of his father's dying breath as he was killed by a shapeshifting demon during Asdasd's birth, was seen as an ill omen by the superstitious villagers.\n\nGrowing up, Asdasd found solace in the company of the swamp's creatures rather than his fellow humans. His affinity for water and uncanny ability to communicate with beasts made him a natural survivor in the treacherous wetlands. While others saw the swamp as a place of danger, Asdasd saw it as a sanctuary.\n\nAs a young teen, Asdasd's life changed forever when he encountered a wise, old ranger named Thorne. Recognizing the boy's potential, Thorne took Asdasd under his wing, teaching him the ways of the ranger and honing his natural talents. Under Thorne's tutelage, Asdasd learned to wield the longbow with deadly precision, using his keen eye and steady hand to strike from afar.\n\nThorne also helped Asdasd develop his innate connection with beasts, teaching him to form deep bonds with the creatures of the wild. Together, they explored the darkest corners of Shadowmere, facing vengeful spirits and nightmarish beings that would make even the bravest warriors quake in fear.\n\nHowever, tragedy struck when Thorne fell victim to a particularly vicious pack of shapeshifting demons. With his dying breath, the old ranger entrusted Asdasd with a sacred mission: to protect the delicate balance between the natural world and the encroaching darkness.\n\nNow, Asdasd roams the misty forests and treacherous swamps of Shadowmere, a solitary figure more at home with beasts than people. His longbow, a parting gift from Thorne, is his constant companion, along with the various creatures he befriends on his journeys. Though not particularly strong or hardy, Asdasd's agility and",
    "movement_speed": 32,
    "name": "asdasd",
    "gender": "Male",
    "hit_points": 9,
    "max_hit_points": 9,
    "level": 1,
    "purchased_items": [],
    "remaining_money": 234
}