{
  "reading": "The Presidency in Timor-Leste: A Cornerstone of Democracy\\n\\nIntroduction\\n\\nThe presidency in Timor-Leste stands as a crucial institution in the young nation's democratic system. Established following the country's independence in 2002, the role of the President is integral to the functioning of Timor-Leste's semi-presidential system of government. This article explores the constitutional powers, limitations, and electoral process of the Timorese presidency, shedding light on its significance in the country's political landscape.\\n\\nConstitutional Powers of the President\\n\\nThe President of Timor-Leste holds several key powers as outlined in the nation's constitution. Foremost among these is the role of [BLANK_1] of the armed forces, granting the President ultimate authority over military matters. The President also plays a crucial role in the legislative process through the power of [BLANK_2], which involves formally publishing and declaring new laws.\\n\\nOne of the most significant powers vested in the President is the right to [BLANK_3] legislation passed by the National Parliament. This power serves as a check on the legislative branch and allows the President to return laws for reconsideration if deemed necessary. Additionally, the President holds the authority to appoint the Prime Minister and other members of the Government, typically following parliamentary elections or in times of political crisis.\\n\\nIn extraordinary circumstances, the President may also exercise the power to [BLANK_4], triggering new elections. This power, however, is subject to strict constitutional limitations and can only be invoked under specific conditions.\\n\\nLimits on Presidential Power\\n\\nWhile the President of Timor-Leste wields considerable authority, there are important checks on this power to maintain a balance within the government. One such limitation is the requirement for [BLANK_5] on certain presidential acts. This means that for some decisions to take effect, they must also be signed by the Prime Minister or relevant ministers, ensuring a degree of consensus between the executive branches.\\n\\nParliamentary oversight serves as another crucial check on presidential power. The National Parliament has the ability to scrutinize and challenge presidential actions through various mechanisms, including questioning sessions and investigative committees.\\n\\nFurthermore, the Constitutional Court plays a vital role in reviewing the constitutionality of presidential actions. This judicial oversight ensures that the President's exercise of power remains within the bounds of the constitution.\\n\\nPresidential Elections and Eligibility\\n\\nThe process of electing the President of Timor-Leste is designed to ensure democratic representation and legitimacy. Presidents are elected through direct, universal suffrage for a term of five years. To be eligible for the presidency, candidates must be Timorese citizens by origin, at least 35 years old, and in full possession of their civil and political rights.\\n\\nThe election is conducted in two rounds if no candidate secures an absolute majority in the first round. In such cases, a run-off election is held between the two candidates who received the most votes. This system ensures that the elected President has broad support from the electorate.\\n\\nImportantly, the Constitution of Timor-Leste limits presidents to two consecutive terms in office. This provision aims to prevent the concentration of power and promote political renewal.\\n\\nConclusion\\n\\nThe presidency in Timor-Leste plays a pivotal role in the nation's governance, embodying both symbolic and practical functions. From serving as a unifying figure for the nation to exercising specific constitutional powers, the President contributes significantly to Timor-Leste's democratic process. The carefully delineated powers and limitations of the office reflect the country's commitment to maintaining a balance of power and ensuring democratic accountability.\\n\\nAs Timor-Leste continues to develop its democratic institutions, the role of the President remains central to the country's political stability and progress. Understanding the nuances of this office is crucial for comprehending the broader political landscape of this young Southeast Asian nation.",
  "vocabulary": {
    "[BLANK_1]": "Commander-in-Chief",
    "[BLANK_2]": "promulgation",
    "[BLANK_3]": "veto",
    "[BLANK_4]": "dissolution of parliament",
    "[BLANK_5]": "countersignatures",
    "[BLANK_6]": "executive power",
    "[BLANK_7]": "decree-law",
    "[BLANK_8]": "term limits",
    "[BLANK_9]": "semi-presidential",
    "[BLANK_10]": "inauguration"
  }
}